import matplotlib.pyplot as plt

# Дані для графіка (значення компонентів)
sizes = [25, 10, 8, 5, 6, 2, 5, 13, 15, 11]

# Мітки для компонентів
labels = ['Виробництво', 'Медицина', 'Освіта', 'Правоохоронці', 'ДСНС', 'Транспорт', 'Енергосфера', 'Екологія', 'Соціальне забеспечення', 'Економіка']

# Створення кругового графіка
plt.pie(sizes, labels=labels, autopct='%1.1f%%', startangle=140)

# Додавання заголовка
# plt.title('Круговий компонентний графік')

# Відображення графіка
plt.axis('equal')  # Забезпечує кругову форму
plt.grid()

plt.show()
