import matplotlib.pyplot as plt

# Дані для графіків
x = ['Січ.', 'Лют.', 'Бер.', 'Кв.', 'Тр.', 'Чер.', 'Лип.', 'Сер.', 'Вер.', 'Жов.', 'Лис.', 'Гр.']
y1 = [28,30,32,35,37,40,43,45,48,50,52,55]
y2 = [50,50,45,43,48,45,50,51,48,43,48,50]
y3 = [30,32,34,37,39,42,45,47,50,52,54,57]
y4 = [60,56,54,58,60,52,56,59,55,56,57,60]
y5 = [32,34,36,39,41,44,47,49,52,54,56,60]
y6 = [65,64,65,63,61,60,64,66,63,61,65,61]

# Створення лінійних графіків
plt.plot(x, y1, label='Ціна А-92')
plt.plot(x, y2, label='Якість А-92')
plt.plot(x, y3, label='Ціна А-95')
plt.plot(x, y4, label='Якість А-95')
plt.plot(x, y5, label='Ціна А-95+')
plt.plot(x, y6, label='Якість А-95+')

# Додавання заголовка та підписів осей
plt.title('Динаміка цін на якості безину А-92, А-95, А-95+')
plt.xlabel('Місяці')
plt.ylabel('грн/літр, рейтинг якості (0-100)')

# Додавання легенди
plt.legend()
plt.grid()

# Відображення графіка
plt.show()
