import matplotlib.pyplot as plt

# Дані для графіка (x та y координати стовпців)
x = ['< 7 тис.', '7-10 тис.', '10-15 тис.', '15-19 тис.', '19-23 тис.', '23-27 тис.', '27-31 тис.', '31-35 тис.', '35+ тис.']
y = [59, 1887, 2962, 1668, 1462, 584, 116, 274, 495]

# Створення стовпчикового графіка
plt.bar(x, y)

# Додавання заголовка та підписів осей
plt.title('Розподіл заробітних плат в компанії')
plt.xlabel('Діапазон зарплат')
plt.ylabel('Кількість робітників')

plt.grid()

# Відображення графіка
plt.show()
